import React, { useState } from 'react';
import './TextRead.css';

const ReadMore = ({ children }) => {
	const text = children;
	const [isReadMore, setIsReadMore] = useState(true);
	return (
		<p className='text'>
			{isReadMore ? text.slice(0, 150) : text}
			<span onClick={() => setIsReadMore(!isReadMore)} className='read-or-hide'>
				{isReadMore ? '...read more' : ' show less'}
			</span>
		</p>
	);
};

const Content = () => {
	return (
		<div className='container'>
			<h2>
				<ReadMore>
					לורם איפסום או בקיצור ליפסום, הוא מלל מקובל וחסר משמעות המשמש "ממלא
					מקום" בעת עריכה, בתחום הדפוס, ההדפסה והפרסום. למשל: לורם איפסום דולור
					סיט אמט, קונסקטורר אדיפיסינג אלית קולורס מונפרד אדנדום סילקוף, מרגשי
					ומרגשח. עמחליף לפרומי בלוף קינץ תתיח לרעח. לת צשחמי צש בליא, מנסוטו
					צמלח לביקו ננבי, צמוקו בלוקריה שיצמה ברורק. להאמית קרהשק סכעיט דז מא,
					מנכם למטכין נשואי מנורךגולר מונפרר סוברט לורם שבצק יהול, לכנוץ בעריר
					גק ליץ, ושבעגט. ושבעגט לבם סולגק. בראיט ולחת צורק מונחף, בגורמי מגמש.
					תרבנך וסתעד לכנו סתשם השמה - לתכי מורגם בורק? לתיג ישבעס. הטקסט משמש
					כלי לייצוג דפוס שאמור להתווסף למוצר הפרסום בעתיד. המדובר במלל ארוך
					במיוחד שניתן לבדוק עמו גופנים, וכן התאמת המלל לעמודים המעוצבים ובדיקת
					סוגי וגדלי גופן והתאמתם למוצר הסופי. בשל הדמיון של המילים בלורם איפסום
					ללטינית קלאסית, רבים חושבים שיש משמעות לטקסט, אולם לא נועדה להיות לו
					כל משמעות. המטרה היא רק "תפיסת מקום" על ידי מלל חסר משמעות. כדוגמת זה
					שמופיע לפניכם מעתה וכולל טקסט שנוצר ב
				</ReadMore>
			</h2>
		</div>
	);
};

export default Content;
